// Написати програму, яка перевіряє, чи є введений рік високосним.
//
//     Кроки для виконання завдання:
//
//Введення року:- Використайте prompt для введення року користувачем.
//
//     Перетворення введених даних на число:
//- Перетворіть введене значення з рядка на число, використовуючи
// parseInt або Number.
//
//     Перевірка введених даних:
//- Переконайтеся, що користувач ввів коректне число.
//
//     Перевірка на високосний рік:
//- Використайте умовні оператори для перевірки, чи є рік високосним.
//
//     Виведення результату:
//- Використайте alert для виведення результату.

// кожен рік, який ділиться на чотири, є високосним,
// за винятком років, які діляться на 100, але не
// діляться на 400. Наприклад, 1700, 1800 і 1900
// роки невисокосні, а 1600 і 2000 — високосні.



document.querySelector('#btn').addEventListener('click',function () {
    let output = document.querySelector('#output');
    let year = parseInt(document.querySelector('#num').value);
    if (isNaN(year)|| typeof year !== 'number'){
        alert('enter the correct value');
    }else {
        if ((year % 4 === 0 && year % 100 !== 0) || year % 400 === 0) {
            output.textContent = year + ' є високосним';
        } else {
            output.textContent = year + ' не є високосним';
            output.style.color = 'red';
        }
    }
})