/*написати програму,яка обчислює середнєарифметичне трьох чисел, введенихкористувачем
 та виводить результат на екран*/

// Кроки для виконання завдання:
// 1.Введення трьох чисел:- Використайте prompt для введення трьох чиселкористувачем.
// 2. Перетворення введених даних на числа:- Перетворіть введені дані з рядків на числа,
// використовуючи parseFloat або Number.
// 3. Обчислення середнього арифметичного:- Використайте арифметичні оператори для
// обчислення суми трьох чисел та поділу на 3.
// 4. Виведення результату:- Використайте alert для виведеннясереднього арифметичного.

console.log('==============================------------------==========================');

let num1 = +prompt('enter first number');
let num2 = +prompt('enter second number');
let num3 = +prompt('enter third number');

let res = (num1 + num2 + num3) / 3;
console.log(res);


let avg = 123.5454545487848;
console.log(avg);

console.log(typeof avg.toFixed(2));