/*
Написати програму, яка генерує випадкове число від 1 до 100
і дозволяє користувачу вгадати його надаючи підказки "більше"
або "менше". Програма повинна продовжувати запитувати у користувача
числа, доки він не відгадає правильне.
Кроки для виконання завдання:
1. Генерація випадкового числа: Використайте Math.random() для
генерації випадкового числа від 1 до 100.
// let randomNumber = Math.floor(Math.random() * 100) + 1
2.Введення користувачем числа: Використайте prompt для запиту
числа у користувача.
3.Перевірка введеного числа:
1.Перевірте, чи введене число є коректним і чи відповідає
випадковому числу.
2.Використайте умовні конструкції для надання підказок
"більше" або "менше".
4.Цикл для продовження запитів:
1.Використайте цикл while або do...while для продовження запитів,
доки користувач не відгадає правильне число.
5.Виведення результату:
1.Виведіть повідомлення про те, що користувач відгадав правильне число.*/


// let value = Math.floor(Math.random() * 100) + 1;
// // console.log(value);
//
// while (true) {
//     let num = Number(prompt('enter your number'));
//     if (num === value) {
//         alert('ви вгадали загадане число');
//         break;
//     } else if (num > value) {
//         alert('загадане число МЕНЬШЕ ніж ' + num);
//     } else {
//         alert('загадане число БІЛЬШЕ ніж ' + num);
//     }
// }

// let value = Math.floor(Math.random() * 100) + 1;
// // console.log(value); // Можете розкоментувати для відладки

// while (true) {
//     let input = prompt('Введіть ваше число:');
//
//     // Перевірка, якщо користувач натиснув "Скасувати"
//     if (input === null) {
//         console.log('Гру завершено.');
//         break;
//     }
//
//     // Конвертація введеного значення в число
//     let num = Number(input);
//
//     // Перевірка, чи є введене значення числом
//     if (isNaN(num)) {
//         console.log('Будь ласка, введіть коректне число!');
//         continue;
//     }
//
//     // Логіка перевірки введеного числа
//     if (num === value) {
//         console.log('Вгадали загадане число!');
//         break;
//     } else if (num > value) {
//         console.log('Загадане число МЕНШЕ ніж ' + num);
//     } else {
//         console.log('Загадане число БІЛЬШЕ ніж ' + num);
//     }
// }






let value = Math.floor(Math.random() * 100) + 1;
// console.log(value);
let gameEnd = false;
while (!gameEnd) {
    let num = Number(prompt('enter your number'));
    if (num === value) {
        alert('ви вгадали загадане число');
        gameEnd = true;
    } else if (num > value) {
        alert('загадане число МЕНЬШЕ ніж ' + num);
    } else {
        alert('загадане число БІЛЬШЕ ніж ' + num);
    }
}