// Завдання 1
// Написати програму, яка обчислює індекс маси тіла (ІМТ) і дає рекомендації на основі отриманого значення.
//Кроки для виконання завдання:
//1. Створити функцію для обчислення ІМТ:
//- Формула:
// Індекс маси тіла розраховується шляхом ділення маси тіла (у кілограмах) на квадрат росту (у метрах квадратних).
// Наприклад, визначимо індекс маси тіла для людини, яка важить 65 кг при зрості 170 см:
//ІМТ = 65 / 1,7×1,7 = 22,5
// 2. Створити функцію для визначення категорії ІМТ:
//- Використайте стандартні категорії ВООЗ:
//- Недостатня вага: ІМТ < 18.5
//- Нормальна вага: 18.5 ≤ ІМТ < 24.9
//- Надмірна вага: 25 ≤ ІМТ < 29.9
//- Ожиріння: ІМТ ≥ 30
// 3. Запросити користувача ввести вагу і ріст:
//- Використайте `prompt` для запиту ваги та росту.
// 4. Обчислити ІМТ користувача і визначити категорію:
//- Викликати функції для обчислення ІМТ та визначення категорії.
// 5. Вивести результати:
//- Використайте `alert` для виведення ІМТ та відповідної категорії.

let weight = +prompt('enter your weight');
let height = +prompt('enter your height');

let IMT = (weight,height)=>{
    let imt =  Math.ceil(weight / Math.pow(height, 2));
    return imt;
}
alert(IMT(weight,height).toFixed(2));
