// написати програму яка обчислює суму всіх чисел
// в діапазоні заданому користувачем

// Задача 3
// Написати програму, яка обчислює суму
// всіх чисел в діапазоні, заданому користувачем
// Кроки для виконання завдання:
// 1.Введення початку та кінця діапазону:
// Використайте prompt для введення початку та
// кінця діапазону.
// 2. Перетворення введених даних на числа:
// Перетворіть введені значення з рядка на числа,
// використовуючи parselnt або Number.
// 3. Перевірка введених даних: Переконайтеся,
// що користувач ввів коректні числа і що початок
// діапазону менший або дорівнює кінцю діапазону.
// 4. Обчислення суми чисел у діапазоні: Використайте
// цикл for для обчислення суми всіх чисел у заданому
// діапазоні.
// 5. Виведення результату: Використайте alert для
// виведення суми.


// let start = parseInt(prompt('enter start number'));
// let end = parseInt(prompt('enter end number'));
//
//
//
// let res = 0;
// for (let i = start; i <=end ; i++) {
//     res +=i;
// }
// console.log(res);


function getValue(msg) {
    while (true) {
        let value = prompt(msg);
        let isValid = !isNaN(value) && value !== null && value !== '';
        if (isValid) return Number(value);
    }
}

let start = getValue('Старт діапазону');
let end = getValue('Кінець діапазону');

if (start > end) {
    alert('початок діапазону не може бути більше кінця діапазону');
} else {
    let res = 0;
    for (let i = start; i <= end; i++) {
        res += i;
    }
    console.log(res);
    alert(`${res}`);
}
