// Написати програму, яка обчислює вік людини на основі введеного року народження
// поточним роком і виводить повідомлення, чи ця людина досягла повноліття.
// Кроки для виконання завдання:
// 1.Введення року народження:- Використайте prompt для введення року народження
// користувачем.
// 2. Обчислення віку:- Збережіть поточний рік у змінну.
// - Використайте арифметичний оператор для обчислення віку (різниця між поточним
// роком і роком народження).
// 3. Перевірка повноліття:- Використайте оператори порівняння для перевірки,
// чи вік більше або дорівнює 18.
// 4. Виведення результату

console.log('=================-------------------=====================');

let currentBirthYear = +prompt('enter your birth year');

let currentYear = new Date().getFullYear();
console.log(currentYear);

let adultAge = 18;
let currentAge = currentYear-currentBirthYear;
console.log(currentAge);
if (currentAge < adultAge){
    console.log('GO HOME');
    alert('GO HOME');
}else {
    console.log('WELCOME');
    alert('WELCOME');
}





